package Domashka01;
//Задача 1:
//        Написать приложение, которое будет вычислять и выводить значение по
//формуле: a=4*(b+c-1)/2;
//b и c задаем в коде самостоятельно.
public class Domashka01_1 {

    public static void main(String[] args) {
        int a;
        int b = 7;
        int c = 5;
        a = 4 * (b + c) / 2;
        System.out.println(a);
    }
}
